{"format":"layers-model","generatedBy":"keras v3.13.1","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.1","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"InputLayer","config":{"batch_shape":[null,25],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer","optional":false,"batch_input_shape":[null,25]}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.2,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}},{"class_name":"Dense","config":{"name":"dense_4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null}}],"build_input_shape":[null,25]}},"training_config":{"loss":"binary_crossentropy","loss_weights":null,"metrics":["accuracy",{"class_name":"Precision","config":{"name":"precision","dtype":"float32","thresholds":null,"top_k":null,"class_id":null}},{"class_name":"Recall","config":{"name":"recall","dtype":"float32","thresholds":null,"top_k":null,"class_id":null}},{"class_name":"AUC","config":{"name":"auc","dtype":"float32","num_thresholds":200,"curve":"ROC","summation_method":"interpolation","multi_label":false,"num_labels":null,"label_weights":null,"from_logits":false}}],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.0005000000237487257,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"dense/kernel","shape":[25,128],"dtype":"float32"},{"name":"dense/bias","shape":[128],"dtype":"float32"},{"name":"dense_1/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_1/bias","shape":[64],"dtype":"float32"},{"name":"dense_2/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_2/bias","shape":[32],"dtype":"float32"},{"name":"dense_3/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_3/bias","shape":[16],"dtype":"float32"},{"name":"dense_4/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_4/bias","shape":[1],"dtype":"float32"}]}]}